src/cf/DataProcessors/РасчетСтраховыхВзносовИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РасчетСтраховыхВзносовИП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаПФР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаПФРсДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаФФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзносаФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыСтраховыхВзносовИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСтраховыхВзносовИП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеСтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыСДоходов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РасчетСтраховыхВзносовИП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу для вызова обработки формирования платежных поручений
//
Функция ТаблицаПлатежейДляФормированияПлатежныхПоручений(Объект) Экспорт
	
	Платежи = Обработки.ФормированиеПлатежныхПорученийНаУплатуНалогов.НоваяТаблицаПлатежей();
	
	// 69.06.5, ФиксированныеСтраховыеВзносы
	Если Объект.СуммаВзносаПФР <> 0 Тогда
		СтрокаПлатежа = Платежи.Добавить();
		СтрокаПлатежа.СчетУчета = ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП;
		СтрокаПлатежа.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПлатежа.Субконто2 = Перечисления.ВидыСтраховыхВзносовИП.ФиксированныеСтраховыеВзносы;
		СтрокаПлатежа.Сумма     = Объект.СуммаВзносаПФР;
	КонецЕсли;
	
	// 69.06.5, СтраховыеВзносыСДоходов
	Если Объект.СуммаВзносаПФРсДоходов <> 0 Тогда
		СтрокаПлатежа = Платежи.Добавить();
		СтрокаПлатежа.СчетУчета = ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП;
		СтрокаПлатежа.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПлатежа.Субконто2 = Перечисления.ВидыСтраховыхВзносовИП.СтраховыеВзносыСДоходов;
		СтрокаПлатежа.Сумма     = Объект.СуммаВзносаПФРсДоходов;
	КонецЕсли;
	
	// 69.06.3
	Если Объект.СуммаВзносаФФОМС <> 0 Тогда
		СтрокаПлатежа = Платежи.Добавить();
		СтрокаПлатежа.СчетУчета = ПланыСчетов.Хозрасчетный.ФОМС_СтраховойГод;
		СтрокаПлатежа.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПлатежа.Сумма     = Объект.СуммаВзносаФФОМС;
	КонецЕсли;
	
	// 69.06.4
	Если Объект.СуммаВзносаФСС <> 0 Тогда
		СтрокаПлатежа = Платежи.Добавить();
		СтрокаПлатежа.СчетУчета = ПланыСчетов.Хозрасчетный.ФСС_СтраховойГод;
		СтрокаПлатежа.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПлатежа.Сумма     = Объект.СуммаВзносаФСС;
	КонецЕсли;
	
	Возврат Платежи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
